[
  {
    "id": 1,
    "title": "Butter Chicken",
    "shortDescription": "A popular Indian dish made with tender chicken pieces in a creamy tomato-based gravy.",
    "timeToPrepare": 45,
    "ingredients": "Chicken, tomato, onion, garlic, ginger, butter, cream, spices, salt, oil",
    "stepsToPrepare": "1. Marinate chicken with spices and yogurt. 2. Grill or bake the chicken. 3. In a pan, sauté onion, garlic, and ginger. 4. Add tomato and cook until soft. 5. Add chicken and spices, stir well. 6. Add cream and simmer for a few minutes. 7. Serve hot with rice or naan."
  },
  {
    "id": 2,
    "title": "Chana Masala",
    "shortDescription": "A spicy and flavorful chickpea dish, popular in North India.",
    "timeToPrepare": 30,
    "ingredients": "Chickpeas, onion, garlic, ginger, tomato, spices, salt, oil",
    "stepsToPrepare": "1. Cook chickpeas until soft. 2. In a pan, sauté onion, garlic, and ginger. 3. Add tomato and cook until soft. 4. Add chickpeas and spices, stir well. 5. Cook for a few minutes. 6. Serve hot with rice or roti."
  },
  {
    "id": 3,
    "title": "Palak Paneer",
    "shortDescription": "A creamy spinach dish with paneer (Indian cottage cheese), popular in North India.",
    "timeToPrepare": 35,
    "ingredients": "Spinach, paneer, onion, garlic, ginger, tomato, spices, salt, oil",
    "stepsToPrepare": "1. Cook spinach until soft. 2. In a pan, sauté onion, garlic, and ginger. 3. Add tomato and cook until soft. 4. Add paneer and spices, stir well. 5. Cook for a few minutes. 6. Serve hot with rice or roti."
  },
  {
    "id": 4,
    "title": "Aloo Gobi",
    "shortDescription": "A popular vegetarian dish from Punjab, made with potatoes and cauliflower.",
    "timeToPrepare": 40,
    "ingredients": "Potatoes, cauliflower, onion, garlic, ginger, tomato, spices, salt, oil",
    "stepsToPrepare": "1. Cut potatoes and cauliflower into small pieces. 2. In a pan, sauté onion, garlic, and ginger. 3. Add tomato and cook until soft. 4. Add potatoes and cauliflower, stir well. 5. Add spices and salt, mix well. 6. Cook until potatoes and cauliflower are tender. 7. Serve hot with rice or roti."
  },
  {
    "id": 5,
    "title": "Matar Paneer",
    "shortDescription": "A vegetarian dish made with peas and paneer (Indian cottage cheese), popular in North India.",
    "timeToPrepare": 35,
    "ingredients": "Peas, paneer, onion, garlic, ginger, tomato, spices, salt, oil",
    "stepsToPrepare": "1. Cook peas until soft. 2. In a pan, sauté onion, garlic, and ginger. 3. Add tomato and cook until soft. 4. Add paneer and spices, stir well. 5. Cook for a few minutes. 6. Serve hot with rice or roti."
  },
  {
    "id": 6,
    "title": "Rajma Chawal",
    "shortDescription": "A popular dish from Punjab, made with kidney beans and rice.",
    "timeToPrepare": 60,
    "ingredients": "Kidney beans, rice, onion, garlic, ginger, tomato, spices, salt, oil",
    "stepsToPrepare": "1. Cook kidney beans until soft. 2. Cook rice according to package instructions. 3. In a pan, sauté onion, garlic, and ginger. 4. Add tomato and cook until soft. 5. Add kidney beans and spices, stir well. 6. Cook for a few minutes. 7. Serve hot with rice."
  },
  {
    "id": 7,
    "title": "Chole Bhature",
    "shortDescription": "A popular street food from Punjab, made with chickpeas and fried bread.",
    "timeToPrepare": 60,
    "ingredients": "Chickpeas, flour, onion, garlic, ginger, tomato, spices, salt, oil",
    "stepsToPrepare": "1. Cook chickpeas until soft. 2. Prepare the bhature dough. 3. Fry the bhature. 4. In a pan, sauté onion, garlic, and ginger. 5. Add tomato and cook until soft. 6. Add chickpeas and spices, stir well. 7. Serve hot with bhature."
  },
  {
    "id": 8,
    "title": "Paneer Tikka",
    "shortDescription": "A popular starter made with paneer marinated in spices and grilled.",
    "timeToPrepare": 30,
    "ingredients": "Paneer, yogurt, onion, garlic, ginger, spices, salt, oil",
    "stepsToPrepare": "1. Marinate paneer with yogurt and spices. 2. Grill or broil the paneer. 3. Serve hot with chutney."
  },
  {
    "id": 9,
    "title": "Chicken Tikka Masala",
    "shortDescription": "A popular Indian dish made with marinated chicken pieces cooked in a creamy tomato-based sauce.",
    "timeToPrepare": 45,
    "ingredients": "Chicken, yogurt, garam masala, paprika, cumin, coriander, turmeric, garlic, ginger, onion, tomato, cream",
    "stepsToPrepare": "1. Marinate chicken in yogurt, spices, and lemon juice. 2. Grill or broil the marinated chicken. 3. Sauté onion, garlic, and ginger. 4. Add tomato, spices, and chicken stock, simmer until thickened. 5. Stir in cream and serve over rice."
  },
  {
    "id": 10,
    "title": "Biryani",
    "shortDescription": "A flavorful Indian dish made with rice, meat, and a variety of spices.",
    "timeToPrepare": 90,
    "ingredients": "Basmati rice, chicken, onion, garlic, ginger, tomato, garam masala, paprika, cumin, coriander, turmeric, saffron, yogurt",
    "stepsToPrepare": "1. Cook rice and set aside. 2. Sauté onion, garlic, and ginger. 3. Add tomato, spices, and chicken, cook until tender. 4. Mix rice, chicken, and saffron-yogurt mixture, bake until heated through."
  },
  {
    "id": 11,
    "title": "Tandoori Chicken",
    "shortDescription": "A popular Indian dish made with marinated chicken pieces cooked in a tandoor (clay oven).",
    "timeToPrepare": 60,
    "ingredients": "Chicken, yogurt, garam masala, paprika, cumin, coriander, turmeric, garlic, ginger, lemon juice",
    "stepsToPrepare": "1. Marinate chicken in yogurt, spices, and lemon juice. 2. Grill or broil the marinated chicken in a tandoor. 3. Serve with raita or flatbread."
  }
]
